//   function
function replaceContent(NodeList, newArray) {
  NodeList.forEach((item, index) => {
    item.innerHTML = newArray[index];
  });
}

langFa.addEventListener("click", () => {
  document.getElementsByTagName("body")[0].classList.remove("enlang");

  // header
  const headerFaContent = [
    "خانه",
    "درباره پارک",
    "طرح جوانه",
    "حوزه ریاست",
    "شبکه فن‌آوری",
    "فن‌نما",
  ];
  replaceContent(navTitles, headerFaContent);
  const langsArrayFa = ["فارسی", "فارسی", "انگلیسی", "عربی"];
  replaceContent(langs, langsArrayFa);

  // head content
  headContentRightUp.innerHTML =
    "به پارک علم و فناوری سیستان و بلوچستان خوش آمدید";
  headContentRightDown.innerHTML =
    "مرکزی برای یادگیری بیشتر و لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ";

  // detail
  const detailFaContent = [
    "بیشتر بدانید",
    "نمایی از پارک علمی فن آوری سیستان و بلوچستان",
    "در این پارک چه می‌گذرد...",
    "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد کتابهای زیادی در شصت و سه درصد گذشته حال و آینده.",
    "",
  ];
  replaceContent(detailTitle, detailFaContent);

  //components
  const compFaContent = [
    "مرکز اصلی پارک",
    "هسته‌های فن‌آوری",
    "فازهای توسعه",
    "خانه‌های خلاق",
    "پردیس علم و فن‌آوری",
    "مرکز نوآوری",
    "مرکز رشد و فن‌آوری",
  ];
  replaceContent(compEnList, compFaContent);

  //   welcome
  const welcFaContent = [
    "سایر بخش‌ها",
    "در این قسمت بخش های با سایر بخش های پارک علمی سیستان و بلوچستان آشنا میشوید و لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.",
    "مرکز نوآوری اجتماعی",
    "مالکیت فکری",
    "معرفی شرکت‌ها",
    "یادنامه",
    "مرجع حل اختلاف کارگران",
    "ارتباط با دانشگاه",
    "آیین‌نامه اجرایی پارک",
    "ناحیه نوآوری زاهدان",
    "گزارش عملکرد",
    "آزمایشگاه‌ها",
    "مرکز نوآوری اجتماعی",
    "کانون‌های توسعه",
    "مرکز انتقال فن‌آوری",
    "مرکز خدمات فنی",
  ];
  replaceContent(welcEnList, welcFaContent);

  //  blog
  const blogFaContent = [
    "اخبار و مقالات",
    "جشنواره طلایه داران شکوه ایران زمین",
    "استاندار سیستان و بلوچستان گفت: دستگاه‌های اجرایی باید به‌صورت دائم با دانشگاه‌ها متصل باشند چرا که این پیوند موجب ارتباط بیشتر و استفاده از فکر و نوآوری تولید شده در دانشگاه‌ها می شود.",
    "مشاهده بیشتر",
    "جشنواره طلایه داران شکوه ایران زمین",
    "استاندار سیستان و بلوچستان گفت: دستگاه‌های اجرایی باید به‌صورت دائم با دانشگاه‌ها متصل باشند چرا که این پیوند موجب ارتباط بیشتر و استفاده از فکر و نوآوری تولید شده در دانشگاه‌ها می شود.",
    "مشاهده بیشتر",
    "جشنواره طلایه داران شکوه ایران زمین",
    "استاندار سیستان و بلوچستان گفت: دستگاه‌های اجرایی باید به‌صورت دائم با دانشگاه‌ها متصل باشند چرا که این پیوند موجب ارتباط بیشتر و استفاده از فکر و نوآوری تولید شده در دانشگاه‌ها می شود.",
    "مشاهده بیشتر",
    "پیام نوروزی رهبر انقلاب به مناسبت آغاز سال ۱۴۰۲",
    "حضرت آیت‌الله خامنه‌ای رهبر انقلاب اسلامی در پیامی به‌ مناسبت آغاز سال ۱۴۰۲، سال جدید را سال ...",
    "مشاهده بیشتر",
    "پیام نوروزی رهبر انقلاب به مناسبت آغاز سال ۱۴۰۲",
    "حضرت آیت‌الله خامنه‌ای رهبر انقلاب اسلامی در پیامی به‌ مناسبت آغاز سال ۱۴۰۲، سال جدید را سال ...",
    "مشاهده بیشتر",
    "پیام نوروزی رهبر انقلاب به مناسبت آغاز سال ۱۴۰۲",
    "حضرت آیت‌الله خامنه‌ای رهبر انقلاب اسلامی در پیامی به‌ مناسبت آغاز سال ۱۴۰۲، سال جدید را سال ...",
    "مشاهده بیشتر",
  ];
  replaceContent(blogEnList, blogFaContent);

  // notif
  const notifFaContent = [
    "اعلانات و همایش ها",
    "در این بخش میتوانید از اخبار همایش ها و تصمیمات جدید مطلع باشید لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است",
    "رویداد کد تا ... کد",
    "جزئیات رویداد لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها جزئیات رویداد لورم ایپسوم متن ساختگی با تولید سادگی...",
    "مشاهده جزئیات",
    "رویداد کد تا ... کد",
    "جزئیات رویداد لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها جزئیات رویداد لورم ایپسوم متن ساختگی با تولید سادگی...",
    "مشاهده جزئیات",
    "رویداد کد تا ... کد",
    "جزئیات رویداد لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها جزئیات رویداد لورم ایپسوم متن ساختگی با تولید سادگی...",
    "مشاهده جزئیات",
    "رویداد کد تا ... کد",
    "جزئیات رویداد لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها جزئیات رویداد لورم ایپسوم متن ساختگی با تولید سادگی...",
    "مشاهده جزئیات",
  ];
  replaceContent(notifEnList, notifFaContent);

  //   gallery
  const gallFaContent = [
    "گالری تصاویر و ویدئوها",
    "تصاویر پارک زیبای علمی و فرهنگی سیستان و بلوچستان رو اینجا مشاهده میکنیم (این یک اسلایدره و به حالت آلبوم اسلاید هاش عوض میشه)",
    "توضیحات تصویر",
    "توضیحات تصویر",
    "توضیحات تصویر",
    "توضیحات تصویر",
  ];
  replaceContent(gallEnList, gallFaContent);

  // video
  const videoFaContent = [
    "نمایی کامل‌تر را در ویدئو های زیر مشاهده کنید...",
    "مرکز نوآوری",
    "مرکز نوآوری",
    "مرکز نوآوری",
    "مرکز نوآوری",
    "مرکز نوآوری",
    "مرکز نوآوری",
    "مشاهده همه",
  ];
  replaceContent(videoEnList, videoFaContent);

  // ruler-item
  const rulerFaContent = [
    "درباره ما و خدمات ما",
    "تعداد شاغلین",
    "تعداد شرکت‌ها",
    "تعداد هسته‌های فن‌آور",
    "تعداد مراکز رشد و نوآوری",
    "تعداد دستیار فناور",
    "فب لب",
    "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه",
    "کارگروه نظارت مالی و اعتباری",
    "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه",
    "کارگروه ثبت اختراع",
    "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه",
    "مشاورین تخصصی",
    "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه",
    "فب لب",
    "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه",
  ];
  replaceContent(rulerEnList, rulerFaContent);

  // others
  const otherFaContent = [
    "سایر مراکز",
    "مرکز رشد",
    "جامع پارک",
    "مرکز نوآوری",
    "بمپور",
    "مرکز نوآوری",
    "زهک",
    "مرکز رشد",
    "دانشگاه زابل",
    "مرکز رشد",
    "سروان",
    "مرکز رشد",
    "دریانوردی",
    "مرکز رشد",
    "بین‌الملل",
    "معرفی",
    "اعضا",
    "شرکت‌ها",
    "هسته‌ها",
    "رویدادها",
    "تاریخچه مرکز رشد جامع پارک",
    "در راستاي برنامه چهارم توسعه و سياست هاي کلان دولت براي توسعه ساختارها و زيربناهاي لازم براي رشد فعاليت هاي دانايي محور در بخش هاي دولتي و خصوصي از طريق ايجاد و گسترش مرکز رشد علم و فناوري، دانشگاه سيستان و بلوچستان از سال ۱۳۸۵ نسبت به درخواست مجوز براي تأسيس مرکز رشد در دانشگاه اقدام و در اين قالب نسبت به تأمين ساختمان و فضاي فيزيکي مناسب براي راه اندازي مرکز رشد واحد هاي فناور در دانشگاه اقدام و با آماده سازي و تجهيز و تأمين خدمات فني و تخصصي و استقرار ستاد مديريتي، هم اکنون تمام بسترسازي لازم را جهت استقرار واحدهاي فناوري براي ۳۰ واحد آماده سازي نموده است.",
    "خدمات مرکز",
    "يکي از مزاياي استقرار مؤسسات فناور، هسته هاي پژوهشي و واحدهاي تحقيق و توسعه در مرکز رشد، بهره برداري از شرايط تجميع و هم افزايي پژوهشي در مجاورت ساير پژوهشگران و امکان حضور در فضايي ميان رشته اي و ميان بخشي است.",
    "مرکز رشد در حال حاضر حدود ۴۵۰۰ متر مربع فضا براي استقرار مؤسسات فناور در اختيار دارد. با تدارک زير ساخت هاي ضروري و با ارزش افزوده در محيط مرکز رشد، امکان ارائه خدمات پشتيباني تخصصي و عمومي به شرح زير به منظور کاهش هزينه ها و ميزان خطرپذيري فعاليت بر اساس تعرفه اي مصوب نيز پيش بيني مي شود:",
    "امکانات کارگاهي و پايلوت هاي نيمه صنعتي",
    "آزمايشگاه هاي تخصصي و تحقيقاتي",
    "خدمات عمومي",
    "خدمات اسکان، دسترسي به تلفن و دورنگار، اتاق انتظار مرکزي، کارپردازي و خدمات دبيرخانه اي، امکان استفاده از اتاق هاي کنفرانس، تجهيزات سمعي و بصري خدمات اطلاع رساني.",
    "مشاهده بیشتر",
  ];
  replaceContent(otherEnList, otherFaContent);

  // footer
  const footerFaContent = [
    "سخن پایانی",
    "خیلی خوشحالیم که از وبسایت پارک علمی فن آوری سیستان و بلوچستان دیدن کردید ، لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله.",
    "پیوندها",
    "پایگاه اطلاع رسانی قوه قضائیه",
    "پایگاه اطلاع رسانی رهبری",
    "پایگاه اطلاع رسانی ریاست جمهوری",
    "دسترسی آسان",
    "خانه",
    "درباره پارک",
    "حوزه ریاست",
    "ارتباط با ما",
    "قوانین سایت",
    "اطلاعات تماس",
    "شماره تماس: 051264878",
    "آدرس ایمیل :",
    "آدرس شرکت : طبرسی شمالی",
  ];
  replaceContent(footerEnList, footerFaContent);

  // footer-bottom
  footBottEnList.innerHTML = "طراحی UI توسط تیم MawDevelopers";
});
